//1) написать программу, которая считывает через prompt число и выводит фразу "четное" или "нечетное" 
// в зависимости от числа.

// const num1 = +prompt('Укажи число');
// if (num1 % 2 === 0){
//     alert('Четное');
// }else{
//     alert('Нечетное');
// };

// ---

// 2) написать программу, которая считывает два числа и выводит "делится" или "не делится" 
// в зависимости от того, делится первое число на второе или нет.

// const a = +prompt('Укажи число');
// const b = +prompt('Укажи число');

// if (a % b === 0){
//     alert('Делится');
// }else{
//     alert('Не делится');
// };

// ---

// 3) написать программу, которая считывает стороны прямоугольного треугольника и выводит его площадь.

// const a = +prompt('Укажи число');
// const b = +prompt('Укажи число');
// const c = +prompt('Укажи число');

// alert(a * b / 2);

// ---

// 4) написать программу, которая получает длины катетов прямоугольного треугольника и выводит гипотенузу. 

// const a = +prompt('Укажи число');
// const b = +prompt('Укажи число');

// alert(Math.sqrt(a ** 2 + b ** 2));

// ---

// 5) написать программу, которая получает число. 
// Если оно делится на 3 или на 7 без остатка или делится на 10 с остатком, то выведите "YES" в ином случае "NO".

// const a = +prompt('Укажи число');

// if (a % 3 === 0 && a % 7 === 0 && a % 10 != 0){
//     alert('Yes');
// }else{
//     alert('No');
// };